//CEDAJCL  JOB MCORNER,'CICS-STUFF',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),
//            NOTIFY=&SYSUID
//*
//*     A¥ADIR RECURSOS A LISTA DE CICS EN EL ARRANQUE DE CICS
//*     COMANDOS: ADD GROUP(XXXX) LIST(XYZLIST)
//*     '*' EN COL 1 = COMENTARIO
//*
//LSTCICS  EXEC PGM=DFHCSDUP
//STEPLIB  DD DSN=DFH410.CICS.SDFHLOAD,DISP=SHR
//DFHCSD   DD DSN=DFH410.CICS.DFHCSD,DISP=SHR
//SYSPRINT DD SYSOUT=A
//SYSIN    DD *
*
* ADD GROUP(CONSOLES) LIST(XYZLIST)
* ADD GROUP(HOL4) LIST(MCORNER)
*
LIST   LIST(MCORNER)  OBJECTS
/*
//*
