//COPYVOL  JOB MCORNER,'COPY-VOLUME',CLASS=A,MSGCLASS=A,REGION=4096K,
//            MSGLEVEL=(1,1),NOTIFY=&SYSUID
//COPY     EXEC PGM=ADRDSSU
//SYSPRINT DD  SYSOUT=A
//SYSOUT   DD  SYSOUT=A
//SOURCE   DD  UNIT=3390,VOL=SER=ZVOL00,DISP=OLD
//TARGET   DD  UNIT=3390,VOL=SER=ZVOLBK,DISP=OLD
//SYSIN    DD  *
   COPY FULL INDDNAME(SOURCE) OUTDDNAME(TARGET) -
        ALLEXCP
/*
