//DASDFMT JOB MCORNER,'DASD-FORMAT',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID   00010000
//ICKDSF EXEC PGM=ICKDSF,REGION=4096K                                   00020000
//SYSPRINT DD  SYSOUT=A                                                 00030000
//SYSOUT   DD  SYSOUT=A                                                 00031000
//SYSIN    DD  *                                                        00040000
  INIT UNITADDRESS(0AA8) NOVERIFY VOLID(ZVOLBK) OWNER(IBMUSER) -        00050000
               VTOC(0,10,15)                                            00060001
/*                                                                      00070000
//                                                                      00080000
