//DEFALIAS JOB MCORNER,'DEFINE-ALIAS',CLASS=A,MSGCLASS=A,
//            MSGLEVEL=(1,1),NOTIFY=&SYSUID
//DEFALIAS EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=A
//SYSOUT   DD  SYSOUT=A
//SYSIN    DD  *
   DEFINE ALIAS -
   (NAME(MCORNER) -
   RELATE(USERCAT.Z111S.MCORNER)) -
   CATALOG(CATALOG.Z111S.MASTER)
/*
