//DEFCAT  JOB MCORNER,'DEFINE-CATALOG',CLASS=A,MSGCLASS=A,
//            MSGLEVEL=(1,1),NOTIFY=&SYSUID
//DFNEWCAT EXEC PGM=IDCAMS
//SYSPRINT DD  SYSOUT=A
//SYSOUT   DD  SYSOUT=A
//SYSIN    DD  *
   DEFINE USERCATALOG -
   (NAME(USERCAT.Z111S.MCORNER) -
     VOLUME(ZVOL00) -
     MEGABYTES(15 5) -
     ICFCATALOG -
     FREESPACE(20 20) -
     STRNO(3) -
     REPLICATE ) -
   DATA( CONTROLINTERVALSIZE(4096) -
     BUFND(4) ) -
   INDEX( BUFNI(4) )
/*
