//EXPVTOC  JOB MCORNER,'EXPAND-VTOC',CLASS=A,MSGCLASS=A,REGION=4096K,
//            MSGLEVEL=(1,1),NOTIFY=&SYSUID
//COPY     EXEC PGM=ICKDSF
//VOLDD     DD DISP=SHR,UNIT=3390,VOL=SER=ZVOL00
//SYSPRINT  DD    SYSOUT=A
//SYSIN     DD    *
  REFORMAT DDNAME(VOLDD) NOVERIFY EXTVTOC(300) EXTINDEX(8)
/*
